In [23]:
import pandas as pd
import numpy as np

df = pd.read_csv("creditPrediction.csv")
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,NaN,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Unknown,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Unknown,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Unknown,NaN,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [24]:
df["Customer_Age"].isnull().values.any()

False

In [25]:
mod_gender = df["Gender"].mode()
mod_gender

0    F
Name: Gender, dtype: object

In [26]:
mod_edu = df["Education_Level"].value_counts()
mod_edu

Education_Level
Graduate         3141
High School      2024
Unknown          1522
Uneducated       1490
College          1020
Post-Graduate     518
Doctorate         452
Name: count, dtype: int64

In [27]:
mod_edu = df["Education_Level"].mode()
mod_edu = mod_edu[0]
new_col = df["Education_Level"].replace("Unknown", mod_edu)
df["Education_Level"] = new_col.values
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,NaN,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Graduate,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Graduate,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Unknown,NaN,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [28]:
mod_inc = df["Income_Category"].mode()
mod_inc = mod_inc[0]
new_col = df["Income_Category"].replace("Unknown", mod_inc)
df["Income_Category"] = new_col.values
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,NaN,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Graduate,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Graduate,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Less than $40K,NaN,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [29]:
mod_card_cat = df["Card_Category"].value_counts()
mod_card_cat

Card_Category
Blue        7666
Silver       464
Gold          97
Platinum      16
Name: count, dtype: int64

In [30]:
mod_card_cat = df["Card_Category"].mode()
mod_card_cat = mod_card_cat[0]
new_col = df["Card_Category"].replace(np.nan, mod_card_cat)
df["Card_Category"] = new_col.values
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,Blue,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Graduate,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Graduate,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Less than $40K,Blue,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [31]:
mean_month = df["Months_on_book"].mean()
mean_month.round()
new_col = df["Months_on_book"].replace(np.nan, mean_month)
df["Months_on_book"] = new_col.values
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,Blue,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Graduate,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Graduate,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Less than $40K,Blue,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [32]:
mean_total = df["Total_Relationship_Count"].value_counts()
mean_total

Total_Relationship_Count
3.0    2310
4.0    1919
5.0    1891
6.0    1873
2.0    1240
1.0     914
Name: count, dtype: int64

In [33]:
mean_total = df["Total_Relationship_Count"].mean()
mean_total = mean_total.round()

In [34]:
new_col = df["Total_Relationship_Count"].replace(np.nan, mean_total)
df["Total_Relationship_Count"] = new_col.values
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Marital_Status,Income_Category,Card_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Credit_Limit,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,Total_Ct_Chng_Q4_Q1,Avg_Utilization_Ratio,Unnamed: 19
0,768805383,45.0,M,3,High School,Married,$60K - $80K,Blue,39.0,5.0,1,3,12691.0,777,1.335,1144,42,1.625,0.061,NaN
1,818770008,49.0,F,5,Graduate,NaN,Less than $40K,Blue,44.0,6.0,1,2,8256.0,864,1.541,1291,33,3.714,0.105,NaN
2,713982108,51.0,M,3,Graduate,Married,$80K - $120K,Blue,36.0,4.0,1,0,3418.0,0,2.594,1887,20,2.333,0.000,NaN
3,769911858,40.0,F,4,High School,NaN,Less than $40K,Blue,34.0,3.0,4,1,3313.0,2517,1.405,1171,20,2.333,0.760,NaN
4,709106358,40.0,M,3,Uneducated,Married,$60K - $80K,Blue,21.0,5.0,1,0,4716.0,0,2.175,816,28,2.500,0.000,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,NaN,$80K - $120K,Blue,30.0,5.0,3,4,13590.0,1528,0.728,2137,52,0.486,0.112,NaN
10163,715207458,46.0,F,1,Graduate,Single,Less than $40K,Blue,39.0,2.0,2,1,2029.0,1074,0.514,4802,90,0.800,0.529,NaN
10164,803665983,52.0,M,0,Graduate,NaN,$60K - $80K,Blue,46.0,3.0,2,4,2742.0,2184,0.592,3829,72,0.532,0.796,NaN
10165,713183508,39.0,F,1,High School,NaN,Less than $40K,Blue,36.0,1.0,3,2,2751.0,1158,0.821,4861,82,0.822,0.421,NaN
10166,718893333,52.0,M,3,Graduate,NaN,$60K - $80K,Blue,36.0,3.0,3,2,18336.0,2077,0.718,7509,84,0.647,0.113,NaN

In [35]:
# Encoding Non-Sequential Features Using One-Hot Encoding
df_encoded = pd.get_dummies(df['Marital_Status'], prefix='Marital_Status')
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop('Marital_Status', axis=1, inplace=True)

df_encoded = pd.get_dummies(df['Card_Category'], prefix='Card_Category')
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop('Card_Category', axis=1, inplace=True)

In [36]:
column_to_move = df.pop("Credit_Limit")
df.insert(len(df.columns), "Credit_Limit", column_to_move)
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Income_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,...,Unnamed: 19,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Unknown,Card_Category_Blue,Card_Category_Gold,Card_Category_Platinum,Card_Category_Silver,Credit_Limit
0,768805383,45.0,M,3,High School,$60K - $80K,39.0,5.0,1,3,...,NaN,0,1,0,0,1,0,0,0,12691.0
1,818770008,49.0,F,5,Graduate,Less than $40K,44.0,6.0,1,2,...,NaN,0,0,0,0,1,0,0,0,8256.0
2,713982108,51.0,M,3,Graduate,$80K - $120K,36.0,4.0,1,0,...,NaN,0,1,0,0,1,0,0,0,3418.0
3,769911858,40.0,F,4,High School,Less than $40K,34.0,3.0,4,1,...,NaN,0,0,0,0,1,0,0,0,3313.0
4,709106358,40.0,M,3,Uneducated,$60K - $80K,21.0,5.0,1,0,...,NaN,0,1,0,0,1,0,0,0,4716.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,$80K - $120K,30.0,5.0,3,4,...,NaN,0,0,0,0,1,0,0,0,13590.0
10163,715207458,46.0,F,1,Graduate,Less than $40K,39.0,2.0,2,1,...,NaN,0,0,1,0,1,0,0,0,2029.0
10164,803665983,52.0,M,0,Graduate,$60K - $80K,46.0,3.0,2,4,...,NaN,0,0,0,0,1,0,0,0,2742.0
10165,713183508,39.0,F,1,High School,Less than $40K,36.0,1.0,3,2,...,NaN,0,0,0,0,1,0,0,0,2751.0
10166,718893333,52.0,M,3,Graduate,$60K - $80K,36.0,3.0,3,2,...,NaN,0,0,0,0,1,0,0,0,18336.0

In [37]:
Q1 = df['Customer_Age'].quantile(0.25)
Q3 = df['Customer_Age'].quantile(0.75)
IQR = Q3 - Q1
lower = Q1 - 1.5*IQR
upper = Q3 + 1.5*IQR
 
# Create arrays of Boolean values indicating the outlier rows
upper_array = np.where(df['Customer_Age'] >= upper)[0]
lower_array = np.where(df['Customer_Age'] <= lower)[0]
 
# Removing the outliers
df.drop(index=upper_array, inplace=True)
df.drop(index=lower_array, inplace=True)
 
df

,CLIENTNUM,Customer_Age,Gender,Dependent_count,Education_Level,Income_Category,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,...,Unnamed: 19,Marital_Status_Divorced,Marital_Status_Married,Marital_Status_Single,Marital_Status_Unknown,Card_Category_Blue,Card_Category_Gold,Card_Category_Platinum,Card_Category_Silver,Credit_Limit
0,768805383,45.0,M,3,High School,$60K - $80K,39.0,5.0,1,3,...,NaN,0,1,0,0,1,0,0,0,12691.0
1,818770008,49.0,F,5,Graduate,Less than $40K,44.0,6.0,1,2,...,NaN,0,0,0,0,1,0,0,0,8256.0
2,713982108,51.0,M,3,Graduate,$80K - $120K,36.0,4.0,1,0,...,NaN,0,1,0,0,1,0,0,0,3418.0
3,769911858,40.0,F,4,High School,Less than $40K,34.0,3.0,4,1,...,NaN,0,0,0,0,1,0,0,0,3313.0
4,709106358,40.0,M,3,Uneducated,$60K - $80K,21.0,5.0,1,0,...,NaN,0,1,0,0,1,0,0,0,4716.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,718673358,35.0,M,3,Doctorate,$80K - $120K,30.0,5.0,3,4,...,NaN,0,0,0,0,1,0,0,0,13590.0
10163,715207458,46.0,F,1,Graduate,Less than $40K,39.0,2.0,2,1,...,NaN,0,0,1,0,1,0,0,0,2029.0
10164,803665983,52.0,M,0,Graduate,$60K - $80K,46.0,3.0,2,4,...,NaN,0,0,0,0,1,0,0,0,2742.0
10165,713183508,39.0,F,1,High School,Less than $40K,36.0,1.0,3,2,...,NaN,0,0,0,0,1,0,0,0,2751.0
10166,718893333,52.0,M,3,Graduate,$60K - $80K,36.0,3.0,3,2,...,NaN,0,0,0,0,1,0,0,0,18336.0

In [38]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

df = pd.read_csv("creditPrediction.csv")

"""""
data preprocessing

"""""

# drop last column because all NaN
df = df.drop("Unnamed: 19", axis=1)
df = df.drop("CLIENTNUM", axis=1)


# replace mod of Marital Status for NaN and Unknown
mod_marriage = df["Marital_Status"].mode()
mod_marriage = mod_marriage[0]
new_col = df["Marital_Status"].replace(np.nan, mod_marriage)
df["Marital_Status"] = new_col.values
new_col = df["Marital_Status"].replace("Unknown", mod_marriage)
df["Marital_Status"] = new_col.values

# replace mod of Gender for NaN
mod_gender = df["Gender"].mode()
mod_gender = mod_gender[0]
new_col = df["Gender"].replace(np.nan, mod_gender)
df["Gender"] = new_col.values

# replace mod of Education_Level for Unknown
mod_edu = df["Education_Level"].mode()
mod_edu = mod_edu[0]
new_col = df["Education_Level"].replace("Unknown", mod_edu)
df["Education_Level"] = new_col.values

# replace mod Income_Category for Unknown
mod_inc = df["Income_Category"].mode()
mod_inc = mod_inc[0]
new_col = df["Income_Category"].replace("Unknown", mod_inc)
df["Income_Category"] = new_col.values

# replace mod Card_Category for NaN
mod_card_cat = df["Card_Category"].mode()
mod_card_cat = mod_card_cat[0]
new_col = df["Card_Category"].replace(np.nan, mod_card_cat)
df["Card_Category"] = new_col.values

# replace mean Months_on_book for NaN
mean_month = df["Months_on_book"].mean()
mean_month = mean_month.round()
new_col = df["Months_on_book"].replace(np.nan, mean_month)
df["Months_on_book"] = new_col.values

# replace mean Total_Relationship_count for NaN
mean_total = df["Total_Relationship_Count"].mean()
mean_total = mean_total.round()
new_col = df["Total_Relationship_Count"].replace(np.nan, mean_total)
df["Total_Relationship_Count"] = new_col.values

# Now we convert the string type columns into numbers using One Hot Encoding

df_encoded = pd.get_dummies(df['Marital_Status'], prefix='Marital_Status')
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop('Marital_Status', axis=1, inplace=True)

df_encoded = pd.get_dummies(df['Card_Category'], prefix='Card_Category')
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop('Card_Category', axis=1, inplace=True)

df_encoded = pd.get_dummies(df['Gender'], prefix='Gender')
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop('Gender', axis=1, inplace=True)

df_encoded = pd.get_dummies(df["Education_Level"], prefix="Education_Level")
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop("Education_Level", axis=1, inplace=True)

df_encoded = pd.get_dummies(df["Income_Category"], prefix="Income_Category")
df_encoded = df_encoded.astype(int)
df = pd.concat([df, df_encoded], axis=1)
df.drop("Income_Category", axis=1, inplace=True)

# move the label column to be the last column
column_to_move = df.pop("Credit_Limit")
df.insert(len(df.columns), "Credit_Limit", column_to_move)

df

,Customer_Age,Dependent_count,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,...,Education_Level_Graduate,Education_Level_High School,Education_Level_Post-Graduate,Education_Level_Uneducated,Income_Category_$120K +,Income_Category_$40K - $60K,Income_Category_$60K - $80K,Income_Category_$80K - $120K,Income_Category_Less than $40K,Credit_Limit
0,45.0,3,39.0,5.0,1,3,777,1.335,1144,42,...,0,1,0,0,0,0,1,0,0,12691.0
1,49.0,5,44.0,6.0,1,2,864,1.541,1291,33,...,1,0,0,0,0,0,0,0,1,8256.0
2,51.0,3,36.0,4.0,1,0,0,2.594,1887,20,...,1,0,0,0,0,0,0,1,0,3418.0
3,40.0,4,34.0,3.0,4,1,2517,1.405,1171,20,...,0,1,0,0,0,0,0,0,1,3313.0
4,40.0,3,21.0,5.0,1,0,0,2.175,816,28,...,0,0,0,1,0,0,1,0,0,4716.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,35.0,3,30.0,5.0,3,4,1528,0.728,2137,52,...,0,0,0,0,0,0,0,1,0,13590.0
10163,46.0,1,39.0,2.0,2,1,1074,0.514,4802,90,...,1,0,0,0,0,0,0,0,1,2029.0
10164,52.0,0,46.0,3.0,2,4,2184,0.592,3829,72,...,1,0,0,0,0,0,1,0,0,2742.0
10165,39.0,1,36.0,1.0,3,2,1158,0.821,4861,82,...,0,1,0,0,0,0,0,0,1,2751.0
10166,52.0,3,36.0,3.0,3,2,2077,0.718,7509,84,...,1,0,0,0,0,0,1,0,0,18336.0

In [39]:

# Define a function to replace outliers with the mode of each column using IQR
def replace_outliers_with_mode_iqr(data):
    # Initialize an empty DataFrame to store the results
    result = pd.DataFrame(index=data.index, columns=data.columns)

    # Loop through each column in the DataFrame
    for col in data.columns:
        Q1 = data[col].quantile(0.25)  # 25th percentile (Q1)
        Q3 = data[col].quantile(0.75)  # 75th percentile (Q3)
        IQR = Q3 - Q1  # Interquartile Range (IQR)
        lower_bound = Q1 - 1.5 * IQR  # Lower bound for outliers
        upper_bound = Q3 + 1.5 * IQR  # Upper bound for outliers

        # Replace outliers with mode for the current column
        mode_val = data.loc[(data[col] >= lower_bound) & (data[col] <= upper_bound), col].mode()[0]
        result[col] = data[col].apply(lambda x: mode_val if x < lower_bound or x > upper_bound else x)

    return result

# Apply the function to replace outliers with mode for each column separately
df = replace_outliers_with_mode_iqr(df)
df

,Customer_Age,Dependent_count,Months_on_book,Total_Relationship_Count,Months_Inactive_12_mon,Contacts_Count_12_mon,Total_Revolving_Bal,Total_Amt_Chng_Q4_Q1,Total_Trans_Amt,Total_Trans_Ct,...,Education_Level_Graduate,Education_Level_High School,Education_Level_Post-Graduate,Education_Level_Uneducated,Income_Category_$120K +,Income_Category_$40K - $60K,Income_Category_$60K - $80K,Income_Category_$80K - $120K,Income_Category_Less than $40K,Credit_Limit
0,45.0,3,39.0,5.0,1,3,777,0.791,1144,42,...,0,0,0,0,0,0,0,0,0,12691.0
1,49.0,5,44.0,6.0,1,2,864,0.791,1291,33,...,1,0,0,0,0,0,0,0,1,8256.0
2,51.0,3,36.0,4.0,1,3,0,0.791,1887,20,...,1,0,0,0,0,0,0,0,0,3418.0
3,40.0,4,34.0,3.0,4,1,2517,0.791,1171,20,...,0,0,0,0,0,0,0,0,1,3313.0
4,40.0,3,21.0,5.0,1,3,0,0.791,816,28,...,0,0,0,0,0,0,0,0,0,4716.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10162,35.0,3,30.0,5.0,3,4,1528,0.728,2137,52,...,0,0,0,0,0,0,0,0,0,13590.0
10163,46.0,1,39.0,2.0,2,1,1074,0.514,4802,90,...,1,0,0,0,0,0,0,0,1,2029.0
10164,52.0,0,46.0,3.0,2,4,2184,0.592,3829,72,...,1,0,0,0,0,0,0,0,0,2742.0
10165,39.0,1,36.0,1.0,3,2,1158,0.821,4861,82,...,0,0,0,0,0,0,0,0,1,2751.0
10166,52.0,3,36.0,3.0,3,2,2077,0.718,7509,84,...,1,0,0,0,0,0,0,0,0,18336.0

In [40]:
from sklearn.model_selection import train_test_split 
from sklearn.linear_model import LinearRegression
from sklearn.metrics import r2_score
from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import Ridge
from sklearn.preprocessing import PolynomialFeatures
from sklearn.ensemble import RandomForestRegressor
from sklearn.neural_network import MLPRegressor
from sklearn.model_selection import GridSearchCV
import math

pf = PolynomialFeatures(degree=2)

scaler = StandardScaler()
# scaler = MinMaxScaler()


y = df.pop("Credit_Limit")
# df_normalized = pd.DataFrame(scaler.fit_transform(df), columns=df.columns)

x = np.array(df)
y = np.array(y)
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.1, shuffle=True)
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)
 
# X_train_poly = pf.fit_transform(X_train)
# X_test_poly = pf.transform(X_test)

# X_train_poly = scaler.fit_transform(X_train_poly)
# X_test_poly = scaler.transform(X_test_poly)

# model = LinearRegression()
# model = Ridge()
model = RandomForestRegressor(n_estimators=100, random_state=0, max_depth=15)
# model = MLPRegressor(max_iter=1500, random_state=0, alpha= 0.0001, learning_rate='adaptive', learning_rate_init=0.01, hidden_layer_sizes=(100,), solver='adam')

model.fit(X_train, y_train)
y_pred = model.predict(X_test)

# model.fit(X_train_poly, y_train)
# y_pred = model.predict(X_test_poly)



mse = round(mean_squared_error(y_true=y_test,y_pred=y_pred))
# r2 = round(r2_score(y_test, y_pred), 2)
# mae = round(mean_absolute_error(y_test, y_pred))
rmse = round(math.sqrt(mse))

# print(r2)
print(mse)
print(rmse)

8189146
2862